package java05_array;

public class Array_01 {
	public static void main(String[] args) {
		
		//배열(Array)
		// - 변수들을 나열한 것, 묶음
		// - 같은 자료형의 여러 개의 변수를 하나의 묶음으로 생성하여 사용하는 문법이다.
		// - 여러 개의 변수를 한 번에 선언(생성)할 수 있다.
		// - 변수들의 이름을 고민하는 노력을 줄일 수 있다.
		// - 한꺼번에 만들어진 변수 공간들을 인덱스(index) 번호를 이용하여 관리한다.
		//-----------------------------------------------------------------
		
		int num; // int타입 변수 선언
		num = 123;
		
		//-----------------------------------------------------------------

		//** int[]
		//   int타입 배열
		//   int형 배열
		
		// 모든 배열 타입은 참조형이다
		
		int[] arr; // int배열 타입 (O), int타입(X), int(형)배열 변수 선언(참조형)
		
		// 참조형 변수의 특징 - String 타입을 제외한 모든 참조형 변수는
		// 대입할 때 new를 앞에 써야 한다.
		
		String str = new String ("Apple"); // 정식 문법
		String str2 = "Apple"; // 허용
		
		arr = new int[5]; // int형 배열의 공간 5개 생성
		
		// 참조 - 내부적으로 값을 저장하기보다는 연결하는 구조
		
		// ** int형 변수 5개를 만들어 연결하고
		// 전체 공간의 이름으로 arr을 부여한다.
		
		// ** arr변수는 배열공간(int[5])을 참조한다.
	
		//-----------------------------------------------------------------

		//에러, 서로 다른 타입의 데이터를 대입하려고 한다
		// arr변수는 int[](int배열) 타입
		// 123값은 int 타입
//		arr = 123;
		
		//-----------------------------------------------------------------
		
		arr[0] = 111;
		arr[1] = 222;
		arr[2] = 333;
		arr[3] = 444;
		arr[4] = 555;
//		arr[5] = 666; // 저장할 때는 에러가 없지만, 실행하자마자 에러가 발생한다.
		// ArrayIndexOutOfBoundsException
		// -> arr배열의 크기(길이)가 5인 상황
		// -> 인덱스 범위는 0 ~ 4
		// -> 코드에서 인덱스 범위를 벗어난 [5]를 사용해서 에러(오류)
		// 음수로 인덱스 지정할 수 없다
		// -> ArrayIndexOutOfBoundsException
//		arr[-3] = 777; 
		//-----------------------------------------------------------------
		
		for(int i=0; i<5; i++) { //i, 0~4
			arr[i] = (i+1);
		}
		
		for(int i=0; i<5; i++) { //i, 0~4
			System.out.println( i + " 인덱스 : " + arr[i]);
		}
		// 배열 변수의 선언
		//- 배열 공간에 대한 참조를 저장할 수 있는 참조형 변수를 선언한다.
		
		//	데이터타입[] 배열변수명; //추천
		//ex) int[] arr;
		//	char[] chArr;
		//	double[] dArr;
		
		// 데이터타입 배열변수명[]; //비추천
		//	int arr[];
		//	char chArr[];
		//	doibl aArr[];
		
		// 배열 공간의 생성
		//- 실제 데이터를 저장할 수 있는 변수공간(메모리공간)을 생성한다
		//- 일반 변수 공간처럼 사용할 수 있다
		
		//- 배열의 공간 == 배열의 요소 (Element)
		
		//new 데이터타입[요소의 개수];
		
		//ex)	int[] arr; //배열 선언
		//		arr = new int[3]; //요소 3개짜리 배열 생성
		
		
		
	}	
}
